wms_mobile/src/Documents/итРучнаяНаборка/итРучнаяНаборка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итРучнаяНаборка</name>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеЗаказа</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеЯчеечногоУчета</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатурыПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаУжеИспользуется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеСканирования</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>170</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатурыПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

wms_mobile/src/Documents/итРучнаяНаборка/Forms/ФормаВыборкаНоменклатурыИдентификатора/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не Параметры.Свойство("МассивДанных") Тогда 
		Отказ=Истина;
		Возврат;
	КонецЕсли;
	Если Параметры.Сообщение="" Тогда 
		Элементы.ПосмотретьСлужебноеСообщение.Видимость=Ложь;
	иначе
		Элементы.ПосмотретьСлужебноеСообщение.Видимость=Истина;
	КонецЕсли;
	Объект=Параметры.Объект;
	ИдентификаторУпаковки=Параметры.ИдентификаторУпаковки;
	Для Каждого стр из Параметры.МассивДанных цикл
		НоваяСтрока=ДанныеВыбора.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,стр);
		НоваяСтрока.ИдентификаторСтроки=новый УникальныйИдентификатор();
	КонецЦикла;
	ЗаполнитьСпискиВыбора();
Если ДанныеВыбора.Количество()=1 Тогда 
	СерияНоменклатурыПредставление=ДанныеВыбора[0].СерияНоменклатурыПредставление;
	НоменклатураПредставление=ДанныеВыбора[0].НоменклатураПредставление;
    Номенклатура=ДанныеВыбора[0].Номенклатура;
    СерияНоменклатуры= ДанныеВыбора[0].СерияНоменклатуры;
	Количество=ДанныеВыбора[0].Количество;
	ДатаРозлива=ДанныеВыбора[0].ДатаРозлива;
	Ячейка= ДанныеВыбора[0].Ячейка;
	ЯчейкаПредставление=ДанныеВыбора[0].ЯчейкаПредставление;
	КоличествоВПаллете=ДанныеВыбора[0].Количество;
	Качество=ДанныеВыбора[0].Качество;
	НоменклатураПредставлениеВыбор=Строка(ДанныеВыбора[0].ИдентификаторСтроки);
    СерияНоменклатурыПредставлениеВыбор=Строка(ДанныеВыбора[0].ИдентификаторСтроки);
	ПолучитьОставшеесяКоличествономенклатурыКнабору();
	КоличествоОсталось=КоличествоОсталось-Количество;
КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьСпискиВыбора()
	Для Каждого стр из ДанныеВыбора цикл
		Элементы.НоменклатураПредставление.СписокВыбора.Добавить(Строка(стр.ИдентификаторСтроки),стр.НоменклатураПредставление);
		Элементы.СерияНоменклатурыПредставление.СписокВыбора.Добавить(Строка(стр.ИдентификаторСтроки),стр.СерияНоменклатурыПредставление);
	КонецЦикла;
	КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьСлужебноеСообщение(Команда)
		Сообщить(Параметры.Сообщение);
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПредставлениеПриИзменении(Элемент)
	ИдентификаторСтроки=новый УникальныйИдентификатор(НоменклатураПредставлениеВыбор);
	Строки=ДанныеВыбора.НайтиСтроки(новый Структура("ИдентификаторСтроки",ИдентификаторСтроки));
	Элементы.СерияНоменклатурыПредставление.СписокВыбора.Очистить();
	Для Каждого стр из Строки цикл
			Элементы.СерияНоменклатурыПредставление.СписокВыбора.Добавить(Строка(стр.ИдентификаторСтроки),стр.СерияНоменклатурыПредставление);
			НоменклатураПредставление=стр.НоменклатураПредставление;
			Количество=стр.Количество;
			КоличествоВПаллете=стр.Количество;
			Ячейка=стр.Ячейка;
			ЯчейкаПредставление=стр.ЯчейкаПредставление;
			ДатаРозлива=стр.ДатаРозлива;
			Качество=стр.Качество;
	КонецЦикла; 
	ПолучитьОставшеесяКоличествономенклатурыКнабору();
	КоличествоОсталось=КоличествоОсталось-Количество;
КонецПроцедуры
&НаСервере
Процедура ПолучитьОставшеесяКоличествономенклатурыКнабору()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	итРучнаяНаборкаДанныеЗаказа.Номенклатура КАК Номенклатура,
		|	итРучнаяНаборкаДанныеЗаказа.КоличествоПлан КАК КоличествоПлан,
		|	итРучнаяНаборкаДанныеЗаказа.КоличествоФакт КАК КоличествоФакт
		|ИЗ
		|	Документ.итРучнаяНаборка.ДанныеЗаказа КАК итРучнаяНаборкаДанныеЗаказа
		|ГДЕ
		|	итРучнаяНаборкаДанныеЗаказа.Ссылка = &Ссылка
		|	И итРучнаяНаборкаДанныеЗаказа.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Ссылка", Объект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КоличествоОсталось=ВыборкаДетальныеЗаписи.КоличествоПлан-ВыборкаДетальныеЗаписи.КоличествоФакт;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	КонецПроцедуры

&НаКлиенте
Процедура СерияНоменклатурыПредставлениеПриИзменении(Элемент)
	ИдентификаторСтроки=новый УникальныйИдентификатор(СерияНоменклатурыПредставлениеВыбор);
	Строки=ДанныеВыбора.НайтиСтроки(новый Структура("ИдентификаторСтроки",ИдентификаторСтроки));
	Элементы.НоменклатураПредставление.СписокВыбора.Очистить();
	Для Каждого стр из Строки цикл
			Элементы.НоменклатураПредставление.СписокВыбора.Добавить(Строка(стр.ИдентификаторСтроки),стр.НоменклатураПредставление);
			СерияНоменклатурыПредставление=стр.СерияНоменклатурыПредставление;
			НоменклатураПредставление=стр.НоменклатураПредставление;
			Количество=стр.Количество;
			КоличествоВПаллете=стр.Количество;
			Ячейка=стр.Ячейка;
			ЯчейкаПредставление=стр.ЯчейкаПредставление;
			ДатаРозлива=стр.ДатаРозлива;
			Качество=стр.Качество;
		КонецЦикла;   
	ПолучитьОставшеесяКоличествономенклатурыКнабору();
	КоличествоОсталось=КоличествоОсталось-Количество;
КонецПроцедуры


&НаКлиенте
Процедура Добавить(Команда)
	Если КоличествоОсталось<0 Тогда 
		Сообщить("Вы пытаетесь забрать больше , чем нужно");
		Возврат
	КонецЕсли;	
	Если СерияНоменклатурыПредставление="" Тогда 
		Сообщить("Не выбрана серия");
		Возврат
	КонецЕсли;	
	СтруктураДанных=новый Структура;
	СтруктураДанных.Вставить("Номенклатура",Номенклатура);
	СтруктураДанных.Вставить("НоменклатураПредставление",НоменклатураПредставление);
	СтруктураДанных.Вставить("СерияНоменклатуры",СерияНоменклатуры);
	СтруктураДанных.Вставить("СерияНоменклатурыПредставление",СерияНоменклатурыПредставление);
	СтруктураДанных.Вставить("ДатаРозлива",ДатаРозлива);
    СтруктураДанных.Вставить("Количество",Количество);
	СтруктураДанных.Вставить("Качество",Качество);
	СтруктураДанных.Вставить("Ячейка",Ячейка);
    СтруктураДанных.Вставить("ЯчейкаПредставление",ЯчейкаПредставление);
    СтруктураДанных.Вставить("ИдентификаторУпаковки",ИдентификаторУпаковки);

	ОповеститьОВыборе(СтруктураДанных);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	Если Количество>КоличествоВПаллете Тогда 
		 Количество=КоличествоВПаллете;
		 Сообщить("не возможно взять больше чем в паллете");
	КонецЕсли;	 
	ПолучитьОставшеесяКоличествономенклатурыКнабору();
	КоличествоОсталось=КоличествоОсталось-Количество;
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры
